Import library and load dataset

In [3]:
#import library
import pandas as pd

In [17]:
#load dataset
df=pd.read_csv('cars.csv')
df

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8.0,307.0,130.0,3504,12.0,70,US
1,Buick Skylark 320,15.0,8.0,350.0,165.0,3693,11.5,70,US
2,Plymouth Satellite,18.0,8.0,318.0,150.0,3436,NaN,70,US
3,AMC Rebel SST,16.0,8.0,304.0,150.0,3433,12.0,70,US
4,Ford Torino,17.0,8.0,302.0,140.0,3449,10.5,70,US
...,...,...,...,...,...,...,...,...,...
401,Ford Mustang GL,27.0,4.0,140.0,86.0,2790,15.6,82,US
402,Volkswagen Pickup,44.0,4.0,97.0,52.0,2130,24.6,82,Europe
403,Dodge Rampage,32.0,4.0,135.0,84.0,2295,11.6,82,US
404,Ford Ranger,28.0,4.0,120.0,79.0,2625,18.6,82,US
405,Chevy S-10,31.0,4.0,119.0,82.0,2720,19.4,82,US

Values and counts

In [5]:
df['Origin'].unique()
#note:O must be in caps because in cars table o is in caps only.
#note:It removes the duplicate

array(['US', 'Europe', 'Japan'], dtype=object)

In [6]:
df['Origin'].nunique()
#note:O must be in caps because in cars table o is in caps only.
#note:It removes the duplicate and indicates how many number of items printed

3

In [7]:
df['Origin'].value_counts()
#note:value_counts() counts he value and print

Origin
US        254
Japan      79
Europe     73
Name: count, dtype: int64

Get value

In [8]:
df.head()
#I first viewed the table to retrieve data

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8.0,307.0,130.0,3504,12.0,70,US
1,Buick Skylark 320,15.0,8.0,350.0,165.0,3693,11.5,70,US
2,Plymouth Satellite,18.0,8.0,318.0,150.0,3436,NaN,70,US
3,AMC Rebel SST,16.0,8.0,304.0,150.0,3433,12.0,70,US
4,Ford Torino,17.0,8.0,302.0,140.0,3449,10.5,70,US

In [9]:
#get cell value [Row index,Column name]
df.loc[3,'Car']
#note:loc is use to identify and retrieve particular data
#note:loc-location
#note:3 is the index of the row(where index stars from 0)and I mentioned column name instead of index

'AMC Rebel SST'

In [10]:
#get cell value using index [Row index,Column name]
df.iloc[3,4]
#note:iloc is the index location
#note: It prints datatype too while we retrieve result
#note:iloc is the index location where it accepts only the index of rows and columns(index starts from 0)

np.float64(150.0)

Set value

In [11]:
#set cell value
df.loc[4,'Car']='toyoto'
df.head()
#NOTE:I replaced the car name by retrieving the particular index and I viwed by df.head()

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8.0,307.0,130.0,3504,12.0,70,US
1,Buick Skylark 320,15.0,8.0,350.0,165.0,3693,11.5,70,US
2,Plymouth Satellite,18.0,8.0,318.0,150.0,3436,NaN,70,US
3,AMC Rebel SST,16.0,8.0,304.0,150.0,3433,12.0,70,US
4,toyoto,17.0,8.0,302.0,140.0,3449,10.5,70,US

Get continous range of values

In [12]:
df.loc[3:5,'Car']
#note:here 3:5 ,i.e from the row 3 to row 5 it prints
#note:Car is the column that alone we asked to display

3       AMC Rebel SST
4              toyoto
5    Ford Galaxie 500
Name: Car, dtype: object

In [13]:
#get continous range
df.loc[3:5,'Displacement': 'Model']
#NOTE: In cars table what we gave in the same upper nad lower case only the column should be if not it occurs error
#note:here 3:5 denotes,to print from the row 3 to row 5
#note:here displacement: model ,denotes to print from the column 'displacemnet' to coumn 'model'

   Displacement  Horsepower  Weight  Acceleration  Model
3         304.0       150.0    3433          12.0     70
4         302.0       140.0    3449          10.5     70
5         429.0       198.0    4341          10.0     70

Get intermittent values

In [14]:
#get 1 and 4 th index of the car name
df.loc[[1,4],'Car']
#NOTE:Here 1,4 is in seperate list then only the computer understands that to function first
#note:here [1,4] denotes,to print the 1 st and 4 th row i.e the colon(:) denotes to print from till to but comma(,) denotes to print the mentionaed alone only

1    Buick Skylark 320
4               toyoto
Name: Car, dtype: object

In [15]:
#get first and fourth index of the car name with weight
df.loc[[1,4],['Car','Weight']]
#note:here 1,4 denotes the first and fourth row 
#note:'Car' and 'weight' denotes the particlar name to print
#note:the colon(:) denotes to print from till to but comma(,) denotes to print the mentionaed alone only

                 Car  Weight
1  Buick Skylark 320    3693
4             toyoto    3449

In [19]:
#get first and fourth index of the car name with weight for both row and column
df.loc[[1,4],[0:5]]

SyntaxError: invalid syntax (1348164545.py, line 2)